Управление ИТ фирмой/Documents/РеализацияТоваровИУслуг.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>РеализацияТоваровИУслуг</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.Доходы</xr:Item>
				<xr:Item>AccumulationRegister.Товары</xr:Item>
				<xr:Item>AccountingRegister.Управленческий</xr:Item>
				<xr:Item>AccumulationRegister.Расходы</xr:Item>
				<xr:Item>AccumulationRegister.ВзаиморасчетыСКонтрагентами</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Покупатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Сумма</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ТоварыИУслуги</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Количество</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаНДС</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Сумма</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Сумма</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНДС</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Сумма</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Скидка</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Управление ИТ фирмой/Catalogs/Номенклатура.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>Номенклатура</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Тип</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтавкаНДС</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НоменклатурнаяГруппа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НоменклатурныеГруппы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Управление ИТ фирмой/Documents/РеализацияТоваровИУслуг/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаКлиенте
Функция СуммаПоСтроке(Строка)
	
	ИсходнаяСумма = Строка.Количество * Строка.Цена;
	РазмерСкидки = ИсходнаяСумма * Строка.Скидка / 100;
	
	Возврат ИсходнаяСумма - РазмерСкидки;
	
КонецФункции

&НаКлиенте
Процедура ПриИзмененииНоменклатуры(ИзмененнаяСтрока)
	
	Если ЗначениеЗаполнено(ИзмененнаяСтрока.Номенклатура) Тогда
		ИзмененнаяСтрока.СтавкаНДС = ПолучитьСтавкуНДСНаСервере(ИзмененнаяСтрока.Номенклатура);
		
		Если Объект.Ссылка.Пустая() Тогда
			РабочаяДата = ТекущаяДата();
		Иначе
			РабочаяДата = Объект.Дата;
		КонецЕсли;
		
		ИзмененнаяСтрока.Цена = ЦеныВызовСервера.ЦенаНаДату(ИзмененнаяСтрока.Номенклатура, РабочаяДата);
		ИзмененнаяСтрока.Скидка = ЦеныВызовСервера.СкидкаНаДату(ИзмененнаяСтрока.Номенклатура, РабочаяДата);
		
		ПриИзмененииЦены(ИзмененнаяСтрока);
		ПриИзмененииСкидки(ИзмененнаяСтрока);
		ПриИзмененииСтавкиНДС(ИзмененнаяСтрока);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииКоличества(ИзмененнаяСтрока)
	
	ИзмененнаяСтрока.Сумма = СуммаПоСтроке(ИзмененнаяСтрока);
	ПриИзмененииСуммы(ИзмененнаяСтрока);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииЦены(ИзмененнаяСтрока)
	
	ПриИзмененииКоличества(ИзмененнаяСтрока);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииСкидки(ИзмененнаяСтрока)
	
	ПриИзмененииКоличества(ИзмененнаяСтрока);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииСуммы(ИзмененнаяСтрока)
	
	ИзмененнаяСтрока.СуммаНДС = НДСКлиентСервер.СуммаНДСПоСтавке(ИзмененнаяСтрока.Сумма, ИзмененнаяСтрока.СтавкаНДС);
	Объект.Сумма = Объект.ТоварыИУслуги.Итог("Сумма");
	
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииСтавкиНДС(ИзмененнаяСтрока)
	
	ПриИзмененииСуммы(ИзмененнаяСтрока);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыИУслугиНоменклатураПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.ТоварыИУслуги.ТекущиеДанные;
	
	Если ТекущаяСтрока <> Неопределено Тогда
		ПриИзмененииНоменклатуры(ТекущаяСтрока);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыИУслугиКоличествоПриИзменении(Элемент) 
	
	ТекущаяСтрока = Элементы.ТоварыИУслуги.ТекущиеДанные; 
	
	Если ТекущаяСтрока <> Неопределено Тогда
		ПриИзмененииКоличества(ТекущаяСтрока);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыИУслугиЦенаПриИзменении(Элемент) 
	
	ТекущаяСтрока = Элементы.ТоварыИУслуги.ТекущиеДанные;
	
	Если ТекущаяСтрока <> Неопределено Тогда
		ПриИзмененииЦены(ТекущаяСтрока);
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыИУслугиСкидкаПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.ТоварыИУслуги.ТекущиеДанные;
	
	Если ТекущаяСтрока <> Неопределено Тогда
		ПриИзмененииСкидки(ТекущаяСтрока);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыИУслугиСуммаПриИзменении(Элемент) 
	
	ТекущаяСтрока = Элементы.ТоварыИУслуги.ТекущиеДанные;
	
	Если ТекущаяСтрока <> Неопределено Тогда
		ПриИзмененииСуммы(ТекущаяСтрока);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыИУслугиСтавкаНДСПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.ТоварыИУслуги.ТекущиеДанные;
	
	Если ТекущаяСтрока <> Неопределено Тогда
		ПриИзмененииСтавкиНДС(ТекущаяСтрока);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Подбор(Команда)
	
	ПараметрыФормы = Новый Структура("ЗакрыватьПриВыборе", Ложь);
	ОткрытьФорму("Справочник.Номенклатура.ФормаВыбора", ПараметрыФормы, Элементы.ТоварыИУслуги);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыИУслугиОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("СправочникСсылка.Номенклатура") Тогда
		ОбработатьВыбраннуюНоменклатуру(ВыбранноеЗначение);
	ИначеЕсли ТипЗнч(ВыбранноеЗначение) = Тип("Массив") Тогда
		Для Каждого ТекЗначение Из ВыбранноеЗначение Цикл
			ОбработатьВыбраннуюНоменклатуру(ТекЗначение);
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьВыбраннуюНоменклатуру(ВыбранныйТовар)
	
	ПараметрыПоиска = Новый Структура("Номенклатура", ВыбранныйТовар);
	НайденныеСтроки = Объект.ТоварыИУслуги.НайтиСтроки(ПараметрыПоиска);
	
	Если НайденныеСтроки.Количество() = 0 Тогда
		НоваяСтрока = Объект.ТоварыИУслуги.Добавить();
		НоваяСтрока.Номенклатура = ВыбранныйТовар;
		НоваяСтрока.Количество = 1;
		НоваяСтрока.СтавкаНДС = ПолучитьСтавкуНДСНаСервере(ВыбранныйТовар);
		
		ПриИзмененииНоменклатуры(НоваяСтрока);
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьСтавкуНДСНаСервере(ТоварСсылка)
	
	Возврат ТоварСсылка.СтавкаНДС;
	
КонецФункции
